/*************************************************************************************
 * 文 件 名:   数据类型_字符型.c
 * 创 建 者：  liming
 * 创建时间：  2021/10/30 19:29
*************************************************************************************/


#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

//用途：字符型主要显示单个的字符
//语法： char ch = 'A';

//注意事项：创建字符型变量的时候，不要用双引号
//单引号中，只能有一个字符，不要有字符串，一个字符可以是转义的字符
//使用%c来作为输出占位符
void test01()
{
	char ch = 'a';
	printf("ch = %c\n", ch);
	printf("char占用的内存空间大小为:%d个字节\n", sizeof(char));  //1个字节 0000 0000 ~ 1111 1111 

	//错误写法1:不要在单引号中写多个字符  ch = 'bcdef';
	//错误写法2：不要用字符串给字符赋值   ch = "a";

	//计算机中存放的内容是0和1，针对于字符该如何进行存储
	//每个字符 对应一个特定的数值，字符和数字建立一个的对应，将数字存放在计算机中
	//为了维护字符和数字的关系，建立了一个表格，ASCII码表(美国信息交换标准代码)

	 
	printf("ch的ASCII编码为：%d\n", ch);
	//我们将char类型也称为小的整型

	int ch2 = 98;
	printf("数字ch2的字符为：%c\n", ch2);

	//常见的ASCII码  
	//a-97  A-65  0-48
}


//大小写转换
void test02()
{
	char ch = 'a';
	printf("转换前ch=%c\n", ch);
	//a 97  A 65  差值32
	ch = ch - 32;    //重新给ch进行一个赋值
	printf("转换前ch=%c\n", ch);

	char ch2 = 'Z';
	printf("转换前ch=%c\n", ch2);
	ch2 = ch2 + 32;
	printf("转换前ch=%c\n", ch2);
}
int main()
{
	test01();
	system("pause");
	return EXIT_SUCCESS;
}
