# include <stdio.h>
int main(void)
{
    int i, j;
    for (i=0; i<4; ++i)
    {
        printf("问世间情是何物, 直教生死相许\n");
        for (j=0; j<3; ++j)
        {
            printf("两情若是久长时, 又岂在朝朝暮暮\n");
        }
    }
    return 0;
}

/*
for(1;2;3)                  先执行1，1成立执行2，2成立执行A(2不成立执行B)，4成立执行5，5成立执行A，6完了执行5，5如果不成立执行3，3成立执行2，2成立执行4，2不成立执行B 
  for(4,5,6)
  A;
  B;
*程序结果 
-----------------------------------------------
问世间情是何物, 直教生死相许
两情若是久长时, 又岂在朝朝暮暮
两情若是久长时, 又岂在朝朝暮暮
两情若是久长时, 又岂在朝朝暮暮
问世间情是何物, 直教生死相许
两情若是久长时, 又岂在朝朝暮暮
两情若是久长时, 又岂在朝朝暮暮
两情若是久长时, 又岂在朝朝暮暮
问世间情是何物, 直教生死相许
两情若是久长时, 又岂在朝朝暮暮
两情若是久长时, 又岂在朝朝暮暮
两情若是久长时, 又岂在朝朝暮暮
问世间情是何物, 直教生死相许
两情若是久长时, 又岂在朝朝暮暮
两情若是久长时, 又岂在朝朝暮暮
两情若是久长时, 又岂在朝朝暮暮

----------------------------------------
*/ 
