#include <stdio.h>

int main(void)
{
	int val;	//存放待判断的数字 
	int m;
	int sum=0;
printf("请输入您需要判断的数字：\n");
scanf("%d",&val);

m=val;
while(m)
{
	sum=sum*10+m%10;
	m /= 10;
}
if (sum==val)
	printf("Yes！\n");
else
	printf("No!\n");
	
system("pause");
return 0;
}
/*
----------------------------------------------------------
1. m=1234成立
   sum=0*10+1234%10=4
   m=1234/10=123
   
2. m=123成立
   sum=4*10+123%10=43
   m=123/10=12
   
3. m=12成立
   sum=43*10+12%10=432
   m=12/10=1
   
4. m=1成立
   sum=432*10+1%10=4321
   m=1/10=0
   
5.m=0不成立 

最终sum=4321 
    

----------------------------------------------------------
*/

