//2022年11月26日17:17:21

#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

//int main()
//{
//	//int a = 6 / 5;//0.6
//	//printf("%d\n", a);
//
//	//float a = 6 / 5;
//	//printf("%f\n", a);
//
//	float a = 6.0 / 5.0;
//	printf("%f\n", a);
//
//	return 0;
//}


//int main()
//{
//	int a = 7 % 3;//
//	printf("%d\n", a);
//
//	return 0;
//}

//int main()
//{
//	int a = 2;   //4个字节，32个比特位 
//	//00000000 00000000 00000000 00000010
//	//左移变成了：
//	//0000000 00000000 00000000 000000100
//	//把a的二进制位向左移动一位(左边丢弃，右边添加一个0)
//	int b = a << 1;
//
//	printf("b = %d\n", b);  //4
//	printf("a = %d\n", a);  //2
//	system("pause");
//	return 0;
//}


//int main()
//{
//	//int a = 10;
//	int a = -1;
//
//	//把a的二进制位向右移动1位
//	//右移：
//	//1.算数右移：右边丢弃，左边补原符号位
//	//2.逻辑右移：右边丢弃，左边补0
//	int b = a >> 1;
//
//	printf("a = %d\n", a);
//	printf("b = %d\n", b);
//	system("pause");
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	//^  - 按（2进制）位异或
//	//对应的二进制位进行异或
//	//规则：相同为0，相异为1
//
//	int c = a ^ b;
//	printf("%d\n", c);  //6
//
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000110
//	//6
//
//
//	//  | - 按（2进制）位或
//	//int c = a | b;
//	//printf("%d\n", c);
//
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000111
//	
//	 
//	// 
//	//& -  按（2进制）位与
//	//int c = a & b;
//	//printf("c = %d\n", c);
//	//
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000001
//	//
//	system("pause");
//}


//int main()
//{
//	int a = 3;
//	int b = 5;
//	//交换
//	// 
//	printf("a=%d b=%d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("a=%d b=%d\n", a, b);
//
//	//printf("a = %d b = %d\n", a, b);
//	////数值太大会溢出
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//	//printf("a = %d b = %d\n", a, b);
//
//	//int c = 0;//空瓶
//	//printf("a = %d b = %d\n", a, b);
//	//c = a;
//	//a = b;
//	//b = c;
//	//printf("a = %d b = %d\n", a, b);
//	system("pause");
//	return 0;
//}

//int  main()
//{
//	short s = 5;
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 2));//
//	printf("%d\n", s);//
//
//	//int a = 10;
//	//int arr[10] = { 0 };
//	//printf("%d\n", sizeof(arr));//单位是字节
//	//printf("%d\n", sizeof(int [10]));//40 - int [10]是arr数组的类型
//
//
//	//printf("%d\n", sizeof(a));//计算a所占空间的大小，单位是字节
//	//printf("%d\n", sizeof(int));
//	//printf("%d\n", sizeof a);
//	//sizeof是一个操作符，不是函数
//
//	return 0;
//}

//int main()
//{
//	int a = -1;
//	//10000000000000000000000000000001 - 原码
//	//11111111111111111111111111111110 - 反码
//	//11111111111111111111111111111111 - 补码
//	//~ 按位取反
//	//11111111111111111111111111111111
//	//00000000000000000000000000000000
//	//
//	int b = ~a;
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	printf("%d\n", a--);//10
//	printf("%d\n", a);//9
//
//	//int b = a++;//后置++，先使用，再++
//	//int b = ++a;//前置++，  先++，后使用
//
//	//int b = a--;//后置--，先使用，后--
//	//int b = --a;
//	//printf("%d\n", a);//
//	//printf("%d\n", b);//
//
//	return 0;
//}


//int main()
//{
//	int a = 10;
//	printf("%p\n", &a);//& - 取地址操作符
//	int * pa = &a;//pa是用来存放地址的 - pa就是一个指针变量
//	*pa = 200;//* - 解引用操作符 - 间接访问操作符
//	printf("%d\n", a);//20
//
//	return 0;
//}

int main()
{
	int a = (int)3.14;

	return 0;
}

//数组传参，传的其实是数组第一个元素的地址