//2022年11月26日17:17:21

#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

//int main()
//{
//	//int a = 6 / 5;//0.6
//	//printf("%d\n", a);
//
//	//float a = 6 / 5;
//	//printf("%f\n", a);
//
//	float a = 6.0 / 5.0;
//	printf("%f\n", a);
//
//	return 0;
//}


//int main()
//{
//	int a = 7 % 3;//
//	printf("%d\n", a);
//
//	return 0;
//}

//int main()
//{
//	int a = 2;   //4个字节，32个比特位 
//	//00000000 00000000 00000000 00000010
//	//左移变成了：
//	//0000000 00000000 00000000 000000100
//	//把a的二进制位向左移动一位(左边丢弃，右边添加一个0)
//	int b = a << 1;
//
//	printf("b = %d\n", b);  //4
//	printf("a = %d\n", a);  //2
//	system("pause");
//	return 0;
//}


//int main()
//{
//	//int a = 10;
//	int a = -1;
//
//	//把a的二进制位向右移动1位
//	//右移：
//	//1.算数右移：右边丢弃，左边补原符号位
//	//2.逻辑右移：右边丢弃，左边补0
//	int b = a >> 1;
//
//	printf("a = %d\n", a);
//	printf("b = %d\n", b);
//	system("pause");
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	//^  - 按（2进制）位异或
//	//对应的二进制位进行异或
//	//规则：相同为0，相异为1
//
//	int c = a ^ b;
//	printf("%d\n", c);  //6
//
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000110
//	//6
//
//
//	//  | - 按（2进制）位或
//	//int c = a | b;
//	//printf("%d\n", c);
//
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000111
//	
//	 
//	// 
//	//& -  按（2进制）位与
//	//int c = a & b;
//	//printf("c = %d\n", c);
//	//
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000001
//	//
//	system("pause");
//}


int main()
{
	int a = 3;
	int b = 5;
	//交换
	// 
	printf("a=%d b=%d\n", a, b);
	a = a ^ b;
	b = a ^ b;
	a = a ^ b;
	printf("a=%d b=%d\n", a, b);

	//printf("a = %d b = %d\n", a, b);
	////数值太大会溢出
	//a = a + b;
	//b = a - b;
	//a = a - b;
	//printf("a = %d b = %d\n", a, b);

	//int c = 0;//空瓶
	//printf("a = %d b = %d\n", a, b);
	//c = a;
	//a = b;
	//b = c;
	//printf("a = %d b = %d\n", a, b);
	system("pause");
	return 0;
}
