/*************************************************************************************
 * 文 件 名:   野指针.c
 * 创 建 者：  liming
 * 创建时间：  2021/11/20 17:09
*************************************************************************************/


#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

int main()
{
	//int a;   //局部变量不初始化的话，默认是随机值
	int* p;    //局部的指针变量，就被初始化为随机值——随机产生的地址
	//printf_s("%d\n", *p);   //报错：使用了未初始化的局部变量p
	*p = 20;
	printf_s("%d\n", *p);
	system("pause");
	return EXIT_SUCCESS;
}
