/*************************************************************************************
 * 文 件 名:   野指针2.c
 * 创 建 者：  liming
 * 创建时间：  2021/11/20 17:17
*************************************************************************************/



#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

int main()
{
	int arr[10] = { 10 };
	int* p = arr;
	//不用取地址符，因为arr本身就是首元素地址
	int i = 0;
	for (i = 0; i < 12; i++)
	{
		p++;
		//当p++越出它能够管理的范围之后，它就会成为野指针——指针越界
	}

	system("pause");
	return EXIT_SUCCESS;
}
